11/data/attachments/e33471537e5f31f3.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_16ffd1cd-2474-4640-b54f-f2b435abd891</nif:username>
            <nif:friendToBeAdded>Carrie_bad_Actions_59935_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>